tutorials/RAS/duneMigration/0_org/Cs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type       fixedValue;
        value      uniform 0;
    }
    outlet
    {
        type       zeroGradient;
    }
    top
    {
        type       zeroGradient;
    }
    bed
    {
	type 	   zeroGradient;
    }
    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
