tutorials/RAS/duneMigration/0_org/finite-area/qb
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       areaVectorField;
    object      qb;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 2 -1 0 0 0 0];

internalField       uniform (0 0 0);

boundaryField
{

    inletFa
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }

    outletFa
    {
        type        zeroGradient;
    }

    sidesFa
    {
        type        empty;
    }
}


// ************************************************************************* //
