tutorials/RAS/duneMigration/Allrun
#!/bin/sh

# Create the vol and fa meshes
blockMesh
makeFaMesh

# create the initial dune geometry
python coneCreateGeom.py

# create the initial time folder
cp -r 0_org 0

# Run sedExnerFoam
sedExnerFoam > log
